Enjection/monty/lib/arch-stm32/altpins.h
namespace altpins {
    constexpr auto Pin (char const* s) {
        int r = *s++ - 'A', n = 0;
        while (*s)
            n = 10 * n + *s++ - '0';
        return (r << 4) | n;
    }

    struct UartAltPins {
        uint16_t pin  :8;
        uint16_t uart :4;
        uint16_t alt  :4;
    };

#if STM32F0
    UartAltPins const uartAltRX [] = {
        { Pin("A1" ), 4, 4 },
        { Pin("A3" ), 1, 1 },
        { Pin("A3" ), 2, 1 },
        { Pin("A5" ), 6, 5 },
        { Pin("A10"), 1, 1 },
        { Pin("A15"), 1, 1 },
        { Pin("A15"), 2, 1 },
        { Pin("B4" ), 5, 4 },
        { Pin("B7" ), 1, 0 },
        { Pin("B11"), 3, 4 },
        { Pin("C1" ), 6, 2 },
        { Pin("C1" ), 7, 1 },
        { Pin("C3" ), 8, 2 },
        { Pin("C5" ), 3, 1 },
        { Pin("C7" ), 7, 1 },
        { Pin("C9" ), 8, 1 },
        { Pin("C11"), 3, 1 },
        { Pin("C11"), 4, 0 },
        { Pin("D2" ), 5, 2 },
        { Pin("D6" ), 2, 0 },
        { Pin("D9" ), 3, 0 },
        { Pin("D14"), 8, 0 },
        { Pin("E9" ), 4, 1 },
        { Pin("E11"), 5, 1 },
        { Pin("F3" ), 7, 1 },
        { Pin("F10"), 6, 1 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 4 },
        { Pin("A2" ), 1, 1 },
        { Pin("A2" ), 2, 1 },
        { Pin("A4" ), 6, 5 },
        { Pin("A9" ), 1, 1 },
        { Pin("A14"), 1, 1 },
        { Pin("A14"), 2, 1 },
        { Pin("B3" ), 5, 4 },
        { Pin("B6" ), 1, 0 },
        { Pin("B10"), 3, 4 },
        { Pin("C0" ), 6, 2 },
        { Pin("C0" ), 7, 1 },
        { Pin("C2" ), 8, 2 },
        { Pin("C4" ), 3, 1 },
        { Pin("C6" ), 7, 1 },
        { Pin("C8" ), 8, 1 },
        { Pin("C10"), 3, 1 },
        { Pin("C10"), 4, 0 },
        { Pin("C12"), 5, 2 },
        { Pin("D5" ), 2, 0 },
        { Pin("D8" ), 3, 0 },
        { Pin("D13"), 8, 0 },
        { Pin("E8" ), 4, 1 },
        { Pin("E10"), 5, 1 },
        { Pin("F2" ), 7, 1 },
        { Pin("F9" ), 6, 1 },
    };
#endif

#if STM32F2
    UartAltPins const uartAltRX [] = {
        { Pin("A1" ), 4, 8 },
        { Pin("A3" ), 2, 7 },
        { Pin("A10"), 1, 7 },
        { Pin("B7" ), 1, 7 },
        { Pin("B11"), 3, 7 },
        { Pin("C7" ), 6, 8 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 8 },
        { Pin("D2" ), 5, 8 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
        { Pin("G9" ), 6, 8 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 8 },
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("B6" ), 1, 7 },
        { Pin("B10"), 3, 7 },
        { Pin("C6" ), 6, 8 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 8 },
        { Pin("C12"), 5, 8 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
        { Pin("G14"), 6, 8 },
    };
#endif

#if STM32F3
    UartAltPins const uartAltRX [] = {
        { Pin("A3" ), 2, 7 },
        { Pin("A10"), 1, 7 },
        { Pin("A15"), 2, 7 },
        { Pin("B4" ), 2, 7 },
        { Pin("B7" ), 1, 7 },
        { Pin("B8" ), 3, 7 },
        { Pin("B9" ), 3, 7 },
        { Pin("B11"), 3, 7 },
        { Pin("C5" ), 1, 7 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 5 },
        { Pin("D2" ), 5, 5 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
        { Pin("E1" ), 1, 7 },
        { Pin("E15"), 3, 7 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("A14"), 2, 7 },
        { Pin("B3" ), 2, 7 },
        { Pin("B6" ), 1, 7 },
        { Pin("B8" ), 3, 7 },
        { Pin("B9" ), 3, 7 },
        { Pin("B10"), 3, 7 },
        { Pin("C4" ), 1, 7 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 5 },
        { Pin("C12"), 5, 5 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
        { Pin("E0" ), 1, 7 },
    };
#endif

#if STM32F4
    UartAltPins const uartAltRX [] = {
        { Pin("A1" ), 4, 8 },
        { Pin("A3" ), 2, 7 },
        { Pin("A8" ), 7, 8 },
        { Pin("A10"), 1, 7 },
        { Pin("A11"), 4,11 },
        { Pin("A12"), 6, 8 },
        { Pin("B3" ), 1, 7 },
        { Pin("B3" ), 7, 8 },
        { Pin("B5" ), 5,11 },
        { Pin("B7" ), 1, 7 },
        { Pin("B8" ), 5,11 },
        { Pin("B11"), 3, 7 },
        { Pin("B12"), 5,11 },
        { Pin("C5" ), 3, 7 },
        { Pin("C7" ), 6, 8 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 8 },
        { Pin("D0" ), 4,11 },
        { Pin("D2" ), 5, 8 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
        { Pin("D14"), 9,11 },
        { Pin("E0" ), 8, 8 },
        { Pin("E2" ),10,11 },
        { Pin("E7" ), 5, 8 },
        { Pin("E7" ), 7, 8 },
        { Pin("F6" ), 7, 8 },
        { Pin("F8" ), 8, 8 },
        { Pin("G0" ), 9,11 },
        { Pin("G9" ), 6, 8 },
        { Pin("G11"),10,11 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 8 },
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("A11"), 6, 8 },
        { Pin("A12"), 4,11 },
        { Pin("A15"), 1, 7 },
        { Pin("A15"), 7, 8 },
        { Pin("B4" ), 7, 8 },
        { Pin("B6" ), 1, 7 },
        { Pin("B6" ), 5,11 },
        { Pin("B9" ), 5,11 },
        { Pin("B10"), 3, 7 },
        { Pin("B13"), 5,11 },
        { Pin("C6" ), 6, 8 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 8 },
        { Pin("C12"), 5, 8 },
        { Pin("D1" ), 4,11 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
        { Pin("D10"), 4, 8 },
        { Pin("D15"), 9,11 },
        { Pin("E1" ), 8, 8 },
        { Pin("E3" ),10,11 },
        { Pin("E8" ), 5, 8 },
        { Pin("E8" ), 7, 8 },
        { Pin("F7" ), 7, 8 },
        { Pin("F9" ), 8, 8 },
        { Pin("G1" ), 9,11 },
        { Pin("G12"),10,11 },
        { Pin("G14"), 6, 8 },
    };
#endif

#if STM32F7
    UartAltPins const uartAltRX [] = {
        { Pin("A1" ), 4, 8 },
        { Pin("A3" ), 2, 7 },
        { Pin("A8" ), 7,12 },
        { Pin("A10"), 1, 7 },
        { Pin("A11"), 4, 6 },
        { Pin("B3" ), 7,12 },
        { Pin("B5" ), 5, 1 },
        { Pin("B7" ), 1, 7 },
        { Pin("B8" ), 5, 7 },
        { Pin("B11"), 3, 7 },
        { Pin("B12"), 5, 8 },
        { Pin("B15"), 1, 4 },
        { Pin("C7" ), 6, 8 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 8 },
        { Pin("D0" ), 4, 8 },
        { Pin("D2" ), 5, 8 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
        { Pin("E0" ), 8, 8 },
        { Pin("E7" ), 7, 8 },
        { Pin("F6" ), 7, 8 },
        { Pin("G9" ), 6, 8 },
        { Pin("H14"), 4, 8 },
        { Pin("I9" ), 4, 8 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 8 },
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("A12"), 4, 6 },
        { Pin("A15"), 7,12 },
        { Pin("B4" ), 7,12 },
        { Pin("B6" ), 1, 7 },
        { Pin("B6" ), 5, 1 },
        { Pin("B9" ), 5, 7 },
        { Pin("B10"), 3, 7 },
        { Pin("B13"), 5, 8 },
        { Pin("B14"), 1, 4 },
        { Pin("C6" ), 6, 8 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 8 },
        { Pin("C12"), 5, 8 },
        { Pin("D1" ), 4, 8 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
        { Pin("E1" ), 8, 8 },
        { Pin("E8" ), 7, 8 },
        { Pin("F7" ), 7, 8 },
        { Pin("G14"), 6, 8 },
        { Pin("H13"), 4, 8 },
    };
#endif

#if STM32G0
    UartAltPins const uartAltRX [] = {
        { Pin("A1" ), 4, 4 },
        { Pin("A3" ), 2, 1 },
        { Pin("A5" ), 6, 3 },
        { Pin("A10"), 1, 1 },
        { Pin("A15"), 2, 1 },
        { Pin("B0" ), 3, 4 },
        { Pin("B1" ), 5, 8 },
        { Pin("B4" ), 5, 3 },
        { Pin("B7" ), 1, 0 },
        { Pin("B9" ), 3, 4 },
        { Pin("B9" ), 6, 8 },
        { Pin("B11"), 3, 4 },
        { Pin("C1" ), 6, 4 },
        { Pin("C5" ), 1, 1 },
        { Pin("C5" ), 3, 0 },
        { Pin("C11"), 3, 0 },
        { Pin("C11"), 4, 1 },
        { Pin("D2" ), 5, 3 },
        { Pin("D6" ), 2, 0 },
        { Pin("D9" ), 3, 0 },
        { Pin("E9" ), 4, 0 },
        { Pin("E11"), 5, 3 },
        { Pin("F10"), 6, 3 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 4 },
        { Pin("A2" ), 2, 1 },
        { Pin("A4" ), 6, 3 },
        { Pin("A5" ), 3, 4 },
        { Pin("A9" ), 1, 1 },
        { Pin("A14"), 2, 1 },
        { Pin("B0" ), 5, 8 },
        { Pin("B2" ), 3, 4 },
        { Pin("B3" ), 5, 3 },
        { Pin("B6" ), 1, 0 },
        { Pin("B8" ), 3, 4 },
        { Pin("B8" ), 6, 8 },
        { Pin("B10"), 3, 4 },
        { Pin("C0" ), 6, 4 },
        { Pin("C4" ), 1, 1 },
        { Pin("C4" ), 3, 0 },
        { Pin("C10"), 3, 0 },
        { Pin("C10"), 4, 1 },
        { Pin("C12"), 5, 3 },
        { Pin("D3" ), 5, 3 },
        { Pin("D5" ), 2, 0 },
        { Pin("D8" ), 3, 0 },
        { Pin("E8" ), 4, 0 },
        { Pin("E10"), 5, 3 },
        { Pin("F9" ), 6, 3 },
    };
#endif

#if STM32G4
    UartAltPins const uartAltRX [] = {
        { Pin("A3" ), 2, 7 },
        { Pin("A10"), 1, 7 },
        { Pin("A15"), 2, 7 },
        { Pin("B4" ), 2, 7 },
        { Pin("B7" ), 1, 7 },
        { Pin("B8" ), 3, 7 },
        { Pin("B11"), 3, 7 },
        { Pin("C5" ), 1, 7 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 5 },
        { Pin("D2" ), 5, 5 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
        { Pin("E1" ), 1, 7 },
        { Pin("E15"), 3, 7 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("A14"), 2, 7 },
        { Pin("B3" ), 2, 7 },
        { Pin("B6" ), 1, 7 },
        { Pin("B9" ), 3, 7 },
        { Pin("B10"), 3, 7 },
        { Pin("C4" ), 1, 7 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 5 },
        { Pin("C12"), 5, 5 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
        { Pin("E0" ), 1, 7 },
        { Pin("G9" ), 1, 7 },
    };
#endif

#if STM32H7
    UartAltPins const uartAltRX [] = {
        { Pin("A1" ), 4, 8 },
        { Pin("A3" ), 2, 7 },
        { Pin("A8" ), 7,11 },
        { Pin("A10"), 1, 7 },
        { Pin("A11"), 4, 6 },
        { Pin("B3" ), 7,11 },
        { Pin("B5" ), 5,14 },
        { Pin("B7" ), 1, 7 },
        { Pin("B8" ), 4, 8 },
        { Pin("B11"), 3, 7 },
        { Pin("B12"), 5,14 },
        { Pin("B15"), 1, 4 },
        { Pin("C7" ), 6, 7 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 8 },
        { Pin("D0" ), 4, 8 },
        { Pin("D2" ), 5, 8 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
        { Pin("D14"), 9,11 },
        { Pin("E0" ), 8, 8 },
        { Pin("E2" ),10,11 },
        { Pin("E7" ), 7, 7 },
        { Pin("F6" ), 7, 7 },
        { Pin("G0" ), 9,11 },
        { Pin("G9" ), 6, 7 },
        { Pin("G11"),10,11 },
        { Pin("H14"), 4, 8 },
        { Pin("I9" ), 4, 8 },
        { Pin("J9" ), 8, 8 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 8 },
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("A12"), 4, 6 },
        { Pin("A15"), 7,11 },
        { Pin("B4" ), 7,11 },
        { Pin("B6" ), 1, 7 },
        { Pin("B6" ), 5,14 },
        { Pin("B9" ), 4, 8 },
        { Pin("B10"), 3, 7 },
        { Pin("B13"), 5,14 },
        { Pin("B14"), 1, 4 },
        { Pin("C6" ), 6, 7 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 8 },
        { Pin("C12"), 5, 8 },
        { Pin("D1" ), 4, 8 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
        { Pin("D15"), 9,11 },
        { Pin("E1" ), 8, 8 },
        { Pin("E3" ),10,11 },
        { Pin("E8" ), 7, 7 },
        { Pin("F7" ), 7, 7 },
        { Pin("G1" ), 9,11 },
        { Pin("G12"),10,11 },
        { Pin("G14"), 6, 7 },
        { Pin("H13"), 4, 8 },
        { Pin("J8" ), 8, 8 },
    };
#endif

#if STM32L0
    UartAltPins const uartAltRX [] = {
        { Pin("A0" ), 2, 0 },
        { Pin("A1" ), 4, 6 },
        { Pin("A3" ), 2, 4 },
        { Pin("A10"), 1, 4 },
        { Pin("A10"), 2, 4 },
        { Pin("A15"), 2, 4 },
        { Pin("B4" ), 5, 6 },
        { Pin("B7" ), 1, 0 },
        { Pin("B7" ), 2, 0 },
        { Pin("C11"), 4, 6 },
        { Pin("D2" ), 5, 6 },
        { Pin("D6" ), 2, 0 },
        { Pin("E9" ), 4, 6 },
        { Pin("E11"), 5, 6 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 6 },
        { Pin("A2" ), 2, 4 },
        { Pin("A9" ), 1, 4 },
        { Pin("A9" ), 2, 4 },
        { Pin("A14"), 2, 4 },
        { Pin("B3" ), 5, 6 },
        { Pin("B6" ), 1, 0 },
        { Pin("B6" ), 2, 0 },
        { Pin("B8" ), 2, 0 },
        { Pin("C10"), 4, 6 },
        { Pin("C12"), 5, 2 },
        { Pin("D5" ), 2, 0 },
        { Pin("E8" ), 4, 6 },
        { Pin("E10"), 5, 6 },
    };
#endif

#if STM32L1
    UartAltPins const uartAltRX [] = {
        { Pin("A3" ), 2, 7 },
        { Pin("A10"), 1, 7 },
        { Pin("B7" ), 1, 7 },
        { Pin("B11"), 3, 7 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 8 },
        { Pin("D2" ), 5, 8 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("B6" ), 1, 7 },
        { Pin("B10"), 3, 7 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 8 },
        { Pin("C12"), 5, 8 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
    };
#endif

#if STM32L4
    UartAltPins const uartAltRX [] = {
        { Pin("A1" ), 4, 8 },
        { Pin("A3" ), 2, 7 },
        { Pin("A10"), 1, 7 },
        { Pin("A15"), 2, 3 },
        { Pin("B7" ), 1, 7 },
        { Pin("B11"), 3, 7 },
        { Pin("C5" ), 3, 7 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 8 },
        { Pin("D2" ), 5, 8 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
        { Pin("G10"), 1, 7 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 8 },
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("B6" ), 1, 7 },
        { Pin("B10"), 3, 7 },
        { Pin("C4" ), 3, 7 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 8 },
        { Pin("C12"), 5, 8 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
        { Pin("G9" ), 1, 7 },
    };
#endif

#if STM32L5
    UartAltPins const uartAltRX [] = {
        { Pin("A1" ), 4, 8 },
        { Pin("A3" ), 2, 7 },
        { Pin("A10"), 1, 7 },
        { Pin("A15"), 2, 3 },
        { Pin("B7" ), 1, 7 },
        { Pin("B11"), 3, 7 },
        { Pin("C5" ), 3, 7 },
        { Pin("C11"), 3, 7 },
        { Pin("C11"), 4, 8 },
        { Pin("D2" ), 5, 8 },
        { Pin("D6" ), 2, 7 },
        { Pin("D9" ), 3, 7 },
        { Pin("G10"), 1, 7 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A0" ), 4, 8 },
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("B6" ), 1, 7 },
        { Pin("B10"), 3, 7 },
        { Pin("C4" ), 3, 7 },
        { Pin("C10"), 3, 7 },
        { Pin("C10"), 4, 8 },
        { Pin("C12"), 5, 8 },
        { Pin("D5" ), 2, 7 },
        { Pin("D8" ), 3, 7 },
        { Pin("G9" ), 1, 7 },
    };
#endif

#if STM32WB
    UartAltPins const uartAltRX [] = {
        { Pin("A10"), 1, 7 },
        { Pin("B7" ), 1, 7 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A9" ), 1, 7 },
        { Pin("B6" ), 1, 7 },
    };
#endif

#if STM32WL
    UartAltPins const uartAltRX [] = {
        { Pin("A3" ), 2, 7 },
        { Pin("A10"), 1, 7 },
        { Pin("B7" ), 1, 7 },
    };
    UartAltPins const uartAltTX [] = {
        { Pin("A2" ), 2, 7 },
        { Pin("A9" ), 1, 7 },
        { Pin("B6" ), 1, 7 },
    };
#endif
}
